---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfigurationInfo.Dispose
source: html/30a8e998-203f-3966-b9af-de12b6686e80.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.Dispose Method

Releases all resources used by the FabricationConfigurationInfo

## Syntax (C#)
```csharp
public void Dispose()
```